{
    "errors": [
        {
            "title": "TLS_error:|268436501:SSL routines:OPENSSL_internal:SSLV3_ALERT_CERTIFICATE_EXPIRED:TLS_error_end",
            "context": "When trying to curl an Istio Ingress Gateway, found this error in the Ingress's istio-proxy logs.",
            "explanation": "This is an issue that can occur with Istio where the TLS certificate on the Ingress Gateway is expired, meaning that the Ingress Gateway can't serve https traffic. The Istio control plane is supposed to periodically rotate these certificates, but if the certificate rotation fails, the Ingress can get stuck in a state with an expired certificate. Note that to see the error message above, you have to enable debug-level logging in the istio-proxy container of the Ingress Gateway pod. To do this you can run `istioctl proxy-config log POD --level=debug`, where `POD` is the name of the pod.",
            "solution": "The fix is to delete the Istio Ingress Gateway pod and create a new one. This should create a new pod with a valid certificate.",
            "tags": ["network", "tls", "security", "istio", "kubernetes", "ingress", "gateway"],
            "date": "10-10-2024",
            "updated": "13-10-2024"
        },
        {
            "title": "docker: Error response from daemon: Conflict. The container name \"/proxy\" is already in use by container \"a635a1388ce802b3c67d9bd0e4505bf5ace05ed632d7f08340a372f0715466e9\". You have to remove (or rename) that container to be able to reuse that name.",
            "context": "Encountered this error when attempting to run a Docker container.",
            "explanation": "This error occurs when you try to create a new Docker container with a name that's already being used by another container. In this case, the name \"proxy\" is already assigned to an existing container.",
            "solution": "Have a look at the containers that you've already got with `docker ps -a`. Remove the existing container with `docker rm <your container>`. Note that if the container is running, you made need to stop it first with `docker kill <your container>`.",
            "tags": ["docker", "kubernetes", "containers"],
            "date": "26-09-2024",
            "updated": "13-10-2024"
        },
        {
            "title": "WARNING: The requested image's platform (linux/amd64) does not match the detected host platform (linux/arm64/v8)",
            "context": "Came across this warning when trying to run `docker run -d --name httpbin citizenstig/httpbin` on my M3 Macbook.",
            "explanation": "This warning occurs when the Docker image's architecture doesn't match the host's architecture. In this case, the image is built for AMD64 (x86_64) architecture, but you're running on an ARM64 system (likely an Apple Silicon Mac or ARM-based server).",
            "solution": "To resolve this, you have several options: Use a multi-architecture image if available, build the image specifically for your architecture, or, if you're using Docker Desktop for Mac, you can use the built-in virtualization, which allows you to run x86 containers on ARM systems.",
            "tags": ["docker", "kubernetes", "containers"],
            "date": "26-09-2024",
            "updated": "12-10-2024"
        }
    ]
}
